{"keras_version": "1.2.1", "config": [{"config": {"batch_input_shape": [null, 36, 128, 3], "name": "batchnormalization_1", "epsilon": 0.001, "gamma_regularizer": null, "trainable": true, "input_dtype": "float32", "mode": 0, "beta_regularizer": null, "momentum": 0.99, "axis": -1}, "class_name": "BatchNormalization"}, {"config": {"activity_regularizer": null, "activation": "relu", "name": "convolution2d_1", "subsample": [5, 5], "nb_col": 5, "init": "glorot_uniform", "b_constraint": null, "nb_filter": 24, "batch_input_shape": [null, 36, 128, 3], "border_mode": "same", "dim_ordering": "tf", "nb_row": 5, "trainable": true, "input_dtype": "float32", "bias": true, "W_regularizer": null, "b_regularizer": null, "W_constraint": null}, "class_name": "Convolution2D"}, {"config": {"activity_regularizer": null, "activation": "relu", "name": "convolution2d_2", "subsample": [1, 1], "nb_col": 5, "init": "glorot_uniform", "b_constraint": null, "nb_filter": 36, "batch_input_shape": [null, 36, 128, 3], "border_mode": "same", "dim_ordering": "tf", "nb_row": 5, "trainable": true, "input_dtype": "float32", "bias": true, "W_regularizer": null, "b_regularizer": null, "W_constraint": null}, "class_name": "Convolution2D"}, {"config": {"border_mode": "same", "dim_ordering": "tf", "name": "maxpooling2d_1", "trainable": true, "strides": [2, 2], "pool_size": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"activity_regularizer": null, "activation": "relu", "name": "convolution2d_3", "subsample": [1, 1], "nb_col": 5, "init": "glorot_uniform", "b_constraint": null, "nb_filter": 48, "batch_input_shape": [null, 36, 128, 3], "border_mode": "same", "dim_ordering": "tf", "nb_row": 5, "trainable": true, "input_dtype": "float32", "bias": true, "W_regularizer": null, "b_regularizer": null, "W_constraint": null}, "class_name": "Convolution2D"}, {"config": {"border_mode": "same", "dim_ordering": "tf", "name": "maxpooling2d_2", "trainable": true, "strides": [2, 2], "pool_size": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"activity_regularizer": null, "activation": "relu", "name": "convolution2d_4", "subsample": [1, 1], "nb_col": 3, "init": "glorot_uniform", "b_constraint": null, "nb_filter": 64, "batch_input_shape": [null, 36, 128, 3], "border_mode": "same", "dim_ordering": "tf", "nb_row": 3, "trainable": true, "input_dtype": "float32", "bias": true, "W_regularizer": null, "b_regularizer": null, "W_constraint": null}, "class_name": "Convolution2D"}, {"config": {"border_mode": "same", "dim_ordering": "tf", "name": "maxpooling2d_3", "trainable": true, "strides": [2, 2], "pool_size": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"activity_regularizer": null, "activation": "relu", "name": "convolution2d_5", "subsample": [1, 1], "nb_col": 3, "init": "glorot_uniform", "b_constraint": null, "nb_filter": 64, "batch_input_shape": [null, 36, 128, 3], "border_mode": "same", "dim_ordering": "tf", "nb_row": 3, "trainable": true, "input_dtype": "float32", "bias": true, "W_regularizer": null, "b_regularizer": null, "W_constraint": null}, "class_name": "Convolution2D"}, {"config": {"border_mode": "same", "dim_ordering": "tf", "name": "maxpooling2d_4", "trainable": true, "strides": [2, 2], "pool_size": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"output_dim": 1164, "activity_regularizer": null, "activation": "linear", "name": "hidden1", "init": "glorot_uniform", "W_constraint": null, "b_constraint": null, "input_dim": 128, "bias": true, "trainable": true, "W_regularizer": null, "b_regularizer": null}, "class_name": "Dense"}, {"config": {"activation": "relu", "name": "activation_1", "trainable": true}, "class_name": "Activation"}, {"config": {"output_dim": 200, "activity_regularizer": null, "activation": "linear", "name": "hidden2", "init": "glorot_uniform", "W_constraint": null, "b_constraint": null, "input_dim": 1164, "bias": true, "trainable": true, "W_regularizer": null, "b_regularizer": null}, "class_name": "Dense"}, {"config": {"activation": "relu", "name": "activation_2", "trainable": true}, "class_name": "Activation"}, {"config": {"output_dim": 50, "activity_regularizer": null, "activation": "linear", "name": "hidden3", "init": "glorot_uniform", "W_constraint": null, "b_constraint": null, "input_dim": 200, "bias": true, "trainable": true, "W_regularizer": null, "b_regularizer": null}, "class_name": "Dense"}, {"config": {"activation": "relu", "name": "activation_3", "trainable": true}, "class_name": "Activation"}, {"config": {"output_dim": 20, "activity_regularizer": null, "activation": "linear", "name": "hidden4", "init": "glorot_uniform", "W_constraint": null, "b_constraint": null, "input_dim": 50, "bias": true, "trainable": true, "W_regularizer": null, "b_regularizer": null}, "class_name": "Dense"}, {"config": {"activation": "relu", "name": "activation_4", "trainable": true}, "class_name": "Activation"}, {"config": {"p": 0.5, "name": "dropout_1", "trainable": true}, "class_name": "Dropout"}, {"config": {"output_dim": 1, "activity_regularizer": null, "activation": "linear", "name": "Steering_Angle", "init": "glorot_uniform", "W_constraint": null, "b_constraint": null, "input_dim": 20, "bias": true, "trainable": true, "W_regularizer": null, "b_regularizer": null}, "class_name": "Dense"}], "class_name": "Sequential"}